app/views/welcome/index.html.erb


<% if Magazine.exists? %>
---
SELECT  1 AS one FROM "magazines" LIMIT 1
SELECT "magazines".* FROM "magazines"