app/controllers/magazines_controller.rb

  def create
    @magazine = Magazine.new(magazine_params)
    if @magazine.save
---
INSERT INTO "magazines" ("title", "edition", "issue", "language") VALUES ($1, $2, $3, $4) RETURNING "id"  [["title", "Field and Stream"], ["edition", 10], ["issue", "2011-11-11"], ["language", "English"]]

  def show
    @magazine = Magazine.find(params[:id])
---
SELECT  "magazines".* FROM "magazines" WHERE "magazines"."id" = $1 LIMIT 1  [["id", 54]]

  def edit
    @magazine = Magazine.find(params[:id])
---
SELECT  "magazines".* FROM "magazines" WHERE "magazines"."id" = $1 LIMIT 1  [["id", 116]]

  def update
    @magazine = Magazine.find(params[:id])
    if @magazine.update(magazine_params)
---
SELECT  "magazines".* FROM "magazines" WHERE "magazines"."id" = $1 LIMIT 1  [["id", 136]]
UPDATE "magazines" SET "title" = $1, "edition" = $2, "language" = $3 WHERE "magazines"."id" = $4  [["title", "Field and Stream"], ["edition", 10], ["language", "English"], ["id", 141]]

  def destroy
    @magazine = Magazine.find(params[:id])
    @magazine.destroy
---
SELECT  "magazines".* FROM "magazines" WHERE "magazines"."id" = $1 LIMIT 1  [["id", 157]]
DELETE FROM "magazines" WHERE "magazines"."id" = $1  [["id", 157]]