app/controllers/users_controller.rb

  def create
    @user = User.new(user_params)
    if @user.save
---
INSERT INTO "users" ("username", "password_digest") VALUES ($1, $2) RETURNING "id"  [["username", "Sample User"], ["password_digest", "$2a$04$qPsm.OdZn5i6SiS8hoJGm.uGFhs9LvsunHejkLWqmB4VqbfLW7T66"]]