app/controllers/welcome_controller.rb

SELECT "magazines".* FROM "magazines"
---
  def index
    @magazines = Magazine.all